import React from 'react';
import ReactDOM from 'react-dom';

import './index.css';
import App from './App';




/* Кратък отговор: Ако сайтът ви е статичен, използвайте каквото и да е, няма значение. 
Но ако имате бекенд, използването на хеш маршрутизиране е препоръчителен подход, а не само за реакция.

Обяснение: Когато се използва хеш, само вашето лицево приложение получава заявката,
 не се правят извиквания към бекенда. Това е важно за производствени среди,
  където имате някакъв защитен и/или някакъв обратен прокси (като NGINX и т.н.),
   API шлюз и т.н. Без хеш, заявката ще трябва първо да се обработи от тях и ако не бъде намерена крайна точка,
    заявете се изпраща към интерфейса. Това създава ненужни обаждания, което води до проблеми с производителността, 
    необработени пътища и т.н. А в съвременните облачни среди това означава повече пари.
 */

ReactDOM.render(
  
  <App />
,
  document.getElementById('root')
);

